# JavaExternal_06_03_2018
Java courses 2018. Polina Laptieva

09_03_Figures
Используя циклы и метод: 
System.out.print("* "), System.out.print("  "),
System.out.print("\n") 
(для перехода на новую строку).  
Выведите на экран: 
· прямоугольник 
· прямоугольный треугольник  
· равносторонний треугольник   
· ромб

09_03_SortArrays

Сортировка последовательности  
1. Упорядочить одномерный масиве вначале отрицательные повозрастанию
   затем положительные по убыванию.
2. В одномерном массиве сначала положительные потом отрицательные за О(n)

Дана целочисленная прямоугольная матрица. 
3. Упорядочить столбцы по убыванию среднего значения. 
4. Упорядочить строки, по возрастанию по самой длинной серии одинаковых элементов.
5. Дана квадратная матрица A порядка M (M — нечетное число). Начи-
ная с элемента A1,1 и перемещаясь по часовой стрелке, вывести все ее эле-
менты по спирали: первая строка, последний столбец, последняя строка в 
обратном  порядке,  первый  столбец  в  обратном  порядке,  оставшиеся  эле-
менты второй строки и т. д.; последним выводится центральный элемент 

13_03_FiguresArray
Cоздать класс Polygon для описания фигур разной размерности
Cоздать динамический массив из разных фигур и вывести информацию на экран
сериализовать фігуры  3 точки 3 линии и 1 треугольник
при десериализации треугольника отобразить скотлько обєктов
сделать 3 файла с сериализованим polygon который будет описывать 3 разные фигуры
и десериализовать отобразить на екран

15_03_Vehicles
Создать абстрактный класс Vehicle. На его основе реализовать классы Plane, Car и Ship. 
Классы должны иметь возможность задавать и получать координаты, параметры средств передвижения (цена, скорость, год выпуска).
Для самолета должна быть определена высота, для самолета и корабля - колво пассажиров. Для корабля - порт приписки.
1. Vehicle с наибольшей ценой
2. Найти механизм год выпуска 2000-2005 с  скоростью выше 150 км\ч, и наименьшей ценой
3. Из Масива Vehicle получить масив Car не старше 5 лет
4. Из Масива Vehicle получить масив Ship не старше 5 лет, с  отсортированой ценой по убыванию

Добавить машину Амфибию, БетМобиль
добавляем 3 интерфейса IFly, ISwim, IMove
Создать 3 последовательности  IFly, ISwim, IMove
в рамках каждой последовательности упорядочить по скорости
методы Мин Макс
добавить к механизмам детали
один статический один иннер (внутренние классы)

23_03_MobileCompany
OOP project
unit test + maven project
Создать консольное приложение, удовлетворяющее следующим требованиям:
1.	Использовать возможности ООП: классы, наследование, полиморфизм, инкапсуляция.
2.	Каждый класс должен иметь исчерпывающее смысл название и информативный состав.
3.	Наследование должно применяться только тогда, когда это имеет смысл.
4.	При кодировании должны быть использованы соглашения об оформлении кода java code convention.
5.	Классы должны быть грамотно разложены по пакетам.
6.	Работа с консолью или консольное меню должно быть минимальным.
7.	Для хранения параметров инициализации можно использовать файлы.

12.	 Мобильная связь. Определить иерархию тарифов мобильной компании. 
Создать список тарифов компании. Посчитать общую численность клиентов.
Провести сортировку тарифов на основе размера абонентской платы.
Найти тариф в компании, соответствующий заданному диапазону параметров.

28_03_Labirint
Составить программу, отыскивающую проход по лабиринту.
Лабиринт представляется в виде матрицы, состоящей из квадратов. Каждый квадрат либо открыт, либо закрыт.
Вход в закрытый квадрат запрещен. Если квадрат открыт, то вход в него возможен со стороны, но не с угла. 
Каждый квадрат определяется его координатами в матрице.

Программа находит проход через лабиринт, двигаясь от заданного входа. После отыскания прохода программа
выводит найденный путь в виде координат квадратов. Для хранения пути использовать стек.

03_04_SearchService
Написать поисковый сервис
по указаному слову найти все URL упорядоченые по возрастанию частоты слова
по произвольному URL перейти и спомощью регулярного выражения найти 20 URL каждому указываете ключевые слова с частотами

Mock для проекта -  проилюстрировать необходимость

24_04_TextAnalyser
Task2
Создать программу обработки текста учебника по программированию с использованием классов: Символ, Слово, Предложение,
Знак препинания и др. Во всех задачах с формированием текста заменять табуляции и последовательности пробелов одним пробелом.
12.	Из текста удалить все слова заданной длины, начинающиеся на согласную букву.
